/*
Navicat MySQL Data Transfer

Source Server         : localhost_3306
Source Server Version : 50714
Source Host           : localhost:3306
Source Database       : cultivation

Target Server Type    : MYSQL
Target Server Version : 50714
File Encoding         : 65001

Date: 2019-06-03 21:23:51
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `administer`
-- ----------------------------
DROP TABLE IF EXISTS `administer`;
CREATE TABLE `administer` (
  `adname` varchar(255) NOT NULL,
  `adpass` varchar(255) NOT NULL,
  PRIMARY KEY (`adname`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of administer
-- ----------------------------
INSERT INTO `administer` VALUES ('admin', 'admin');

-- ----------------------------
-- Table structure for `browse`
-- ----------------------------
DROP TABLE IF EXISTS `browse`;
CREATE TABLE `browse` (
  `title` varchar(255) NOT NULL,
  `pid` int(11) NOT NULL,
  `author` varchar(255) NOT NULL,
  `time` datetime NOT NULL,
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `browseuser` varchar(255) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `author` (`author`)
) ENGINE=MyISAM AUTO_INCREMENT=14 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of browse
-- ----------------------------
INSERT INTO `browse` VALUES ('波士顿龙虾，来自大西洋的海鲜盛宴', '25', '大渔场', '2019-04-09 22:34:17', '2', 'a');
INSERT INTO `browse` VALUES ('全国大量求购河虾、山根麦穗杂鱼寻长期合作伙伴', '16', '白洋淀水产供销公司', '2019-04-24 17:02:50', '4', 'a');
INSERT INTO `browse` VALUES ('引起南美白对虾苗期疯狂“偷死”综合症的病因——弧菌不得不谈', '3', '水产周扒皮', '2019-05-07 16:15:35', '5', 'a');
INSERT INTO `browse` VALUES ('河虾青虾苗', '15', '菱湖水产合作', '2019-05-10 12:48:30', '13', 'a');
INSERT INTO `browse` VALUES ('求购冰冻南美白对虾', '6', '大灰', '2019-05-09 19:36:03', '7', 'z');
INSERT INTO `browse` VALUES ('肝胰脏问问题是制约对虾成活率的重要因素，保护肝胰脏不可忽视！', '7', '水产问题专家', '2019-05-09 19:36:06', '8', 'z');
INSERT INTO `browse` VALUES ('工厂化水产养殖漆 养殖水泥池刷漆 天可汗养殖漆', '8', '天可汗生态池漆', '2019-05-09 19:36:09', '9', 'z');
INSERT INTO `browse` VALUES ('1.8万亩湖面需求南美白对虾育苗公司合作养殖', '5', '段小平个体经营', '2019-05-10 01:46:23', '11', 'a');
INSERT INTO `browse` VALUES ('供应冷冻罗氏沼虾', '12', '水产品供应江苏', '2019-05-10 02:15:56', '12', 'a');

-- ----------------------------
-- Table structure for `collection`
-- ----------------------------
DROP TABLE IF EXISTS `collection`;
CREATE TABLE `collection` (
  `collectuser` varchar(255) NOT NULL,
  `title` varchar(255) NOT NULL,
  `author` varchar(255) NOT NULL,
  `pid` int(11) NOT NULL,
  `time` datetime NOT NULL,
  `id` int(11) NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=14 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of collection
-- ----------------------------
INSERT INTO `collection` VALUES ('a', '工厂化水产养殖漆 养殖水泥池刷漆 天可汗养殖漆', '天可汗生态池漆', '8', '2019-05-10 12:49:21', '13');
INSERT INTO `collection` VALUES ('a', '波士顿龙虾，来自大西洋的海鲜盛宴', 'a', '25', '2019-05-10 02:49:34', '9');

-- ----------------------------
-- Table structure for `comments`
-- ----------------------------
DROP TABLE IF EXISTS `comments`;
CREATE TABLE `comments` (
  `title` varchar(255) NOT NULL,
  `comment` text NOT NULL,
  `time` datetime NOT NULL,
  `pid` int(11) NOT NULL,
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `commentuser` varchar(255) NOT NULL,
  `zan` int(11) DEFAULT '0',
  `cai` int(11) DEFAULT '0',
  `fid` int(11) DEFAULT NULL,
  `author` varchar(255) NOT NULL,
  `headimg` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=123 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of comments
-- ----------------------------
INSERT INTO `comments` VALUES ('河虾青虾苗', '我有需要，希望能与您联系', '2019-04-12 14:50:36', '15', '90', 'a', '0', '0', '1', '菱湖水产合作', 'http://127.0.0.1:3000/public/images/me_2019_4_4_2_59.jpg');
INSERT INTO `comments` VALUES ('波士顿龙虾，来自大西洋的海鲜盛宴', '我这边有买家资源，方便的话请联系', '2019-05-09 16:08:43', '25', '117', 'a', '0', '0', '1', 'a', 'http://127.0.0.1:3000/public/images/me_2019_4_4_2_59.jpg');
INSERT INTO `comments` VALUES ('工厂化水产养殖漆 养殖水泥池刷漆 天可汗养殖漆', '沈老版，真有钱。', '2019-05-10 12:47:50', '8', '122', 'a', '0', '0', '1', '天可汗生态池漆', 'http://127.0.0.1:3000/public/images/me_2019_4_4_2_59.jpg');

-- ----------------------------
-- Table structure for `comments2`
-- ----------------------------
DROP TABLE IF EXISTS `comments2`;
CREATE TABLE `comments2` (
  `title` varchar(255) NOT NULL,
  `commentuser` varchar(255) NOT NULL,
  `pid` int(11) NOT NULL,
  `sid` int(11) NOT NULL,
  `comment` text NOT NULL,
  `time` datetime NOT NULL,
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `author` varchar(255) NOT NULL,
  `headimg` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=40 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of comments2
-- ----------------------------
INSERT INTO `comments2` VALUES ('河虾青虾苗', 'a', '15', '1', '希望您能尽快回复', '2019-04-12 14:51:55', '3', '菱湖水产合作', 'http://127.0.0.1:3000/public/images/me_2019_4_4_2_59.jpg');
INSERT INTO `comments2` VALUES ('波士顿龙虾，来自大西洋的海鲜盛宴', 'gd', '25', '1', '价格可以商量', '2019-04-19 14:54:10', '4', 'a', 'http://127.0.0.1:3000/public/images/timg.jpg');
INSERT INTO `comments2` VALUES ('波士顿龙虾，来自大西洋的海鲜盛宴', 'a', '25', '1', '请问您的联系方式是多少？', '2019-05-09 17:23:23', '33', 'a', 'http://127.0.0.1:3000/public/images/me_2019_4_4_2_59.jpg');
INSERT INTO `comments2` VALUES ('工厂化水产养殖漆 养殖水泥池刷漆 天可汗养殖漆', 'a', '8', '1', '对的', '2019-05-10 12:48:02', '38', '天可汗生态池漆', 'http://127.0.0.1:3000/public/images/me_2019_4_4_2_59.jpg');
INSERT INTO `comments2` VALUES ('工厂化水产养殖漆 养殖水泥池刷漆 天可汗养殖漆', 'a', '8', '1', '对的', '2019-05-10 12:48:17', '39', '天可汗生态池漆', 'http://127.0.0.1:3000/public/images/me_2019_4_4_2_59.jpg');

-- ----------------------------
-- Table structure for `contents`
-- ----------------------------
DROP TABLE IF EXISTS `contents`;
CREATE TABLE `contents` (
  `title` varchar(255) NOT NULL,
  `img` varchar(255) DEFAULT 'http://127.0.0.1:3000/public/images/no_pic.gif',
  `author` varchar(255) NOT NULL,
  `contact` varchar(255) NOT NULL,
  `location` varchar(255) NOT NULL,
  `categories` varchar(255) NOT NULL,
  `sad` varchar(255) NOT NULL,
  `phone` varchar(255) NOT NULL,
  `price` varchar(255) NOT NULL,
  `email` varchar(255) DEFAULT NULL,
  `website` varchar(255) DEFAULT NULL,
  `start` varchar(255) NOT NULL,
  `end` varchar(255) NOT NULL,
  `content` text NOT NULL,
  `id` int(255) NOT NULL AUTO_INCREMENT,
  `doing` varchar(255) NOT NULL DEFAULT '进行中',
  PRIMARY KEY (`id`),
  KEY `title` (`title`),
  KEY `author` (`author`)
) ENGINE=MyISAM AUTO_INCREMENT=112 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of contents
-- ----------------------------
INSERT INTO `contents` VALUES ('引起南美白对虾苗期疯狂“偷死”综合症的病因——弧菌不得不谈', 'http://127.0.0.1:3000/public/images/2019032113333586.jpg', '水产周扒皮', '周玲', '济南槐荫区绿地中央广场', '南美白对虾', '供方', '15505417562', '', '', '', '2019-03-21 13:33:00', '2028-12-30', '春暖花开，春江水暖，南方许多地区已经开始了南美白对虾的放苗工作。放苗之后最怕的就是发生早期偷死综合征（EMS），放苗后30天内，莫名其妙地死虾，死虾肝胰腺肿大、糜烂、萎缩、坏死，几天之内就所剩无几只能排塘处理了，根本来不及做任何挽救措施。引起南美白对虾苗期疯狂“偷死”综合症的病因——弧菌不得不谈这那么是什么原因造成的南美白对虾苗期的偷死呢？引起苗期早期偷死症的原因是复杂多样的，其中弧菌是引起病变爆发的重要原因之一。感染弧菌的虾苗摄食量减少，消化道不饱满甚至空胃，运动能力差，行为异常，在池边浅水处不规则游动。病情严重时，对虾常在几十小时或几天内死亡，死亡率可达95%以上。引起南美白对虾苗期疯狂“偷死”综合症的病因——弧菌不得不谈针对水体中的弧菌，用的最多的就是消毒药，但对体内的弧菌是束手无策的。抗生素针对体内弧菌倒是有一定效果，但抗生素的频繁使用会带来一系列严重后果,如产生耐药性、造成水体污染、降低虾体免疫力、影响对虾生长等。在国家对水产品的监管日益严格的形势下，使用抗生素带来的药物残留问题也越来越不容忽视。引起南美白对虾苗期疯狂“偷死”综合症的病因——弧菌不得不谈那么如何减少南美白对虾弧菌引起的早期偷死症呢?首先：从源头入手，避免购买携带弧菌的虾苗。其次：弧菌是一种条件致病菌，也就是说虾农如果做好对虾外部环境（水质、盐度、ph值）等方面入手，那么弧菌的致病能力将大大降低，虽然不同的弧菌，它的致病条件不尽相同，但是保持池塘环境的稳定，将为我们在防治弧菌奠定了坚实的基础。最后：在放苗之后，定期服用龙昌乐畅桉树精油，一个来自澳大利亚维多利亚州的多苞桉桉树精油制成的纯绿色植物提取物，富含1，8-桉叶素等多种植物活性成分，天然具有很强的抗菌消炎作用。在天气多变和细菌容易滋生的季节，拌料和泼洒使用乐畅，可以有效抑制水体和虾体中的弧菌，有效预防治疗对虾弧菌，减少对虾苗期偷死。同时桉树精油的成分绝对安全、无毒无刺激，没有抗药性和药物残留，可以避免滥用抗生素和消毒药带来的环境、食品等系列问题。文章来源于山东龙昌动物保健品有限公司原创文章,转载请标明来源，谢谢！', '3', '进行中');
INSERT INTO `contents` VALUES ('1.8万亩湖面需求南美白对虾育苗公司合作养殖', 'http://127.0.0.1:3000/public/images/no_pic.gif', '段小平个体经营', '段先生', '山东省济宁市', '南美白对虾', '求方', '15801847936', '面议', '', '', '2019-01-02 08:24:00', '2018-12-30', '现有大面积湖泊1.8万亩，位于山东省济宁市内，寻找南美白对虾育苗公司，进行养殖合作，诚信合作，非诚勿扰。联系电话：15801847936（微信同号）', '5', '进行中');
INSERT INTO `contents` VALUES ('求购冰冻南美白对虾', 'http://127.0.0.1:3000/public/images/no_pic.gif', '大灰', '陈先生', '河北邯郸峰峰矿区滏阳东路在水一方西', '南美白对虾', '求方', '17717163180', '', '', '', '2018-12-05 14:38:00', '2018-12-30', '饭店长期使用，要求规格4050冰冻南美白对虾。', '6', '进行中');
INSERT INTO `contents` VALUES ('肝胰脏问问题是制约对虾成活率的重要因素，保护肝胰脏不可忽视！', 'http://127.0.0.1:3000/public/images/2019031511512168.jpg', '水产问题专家', '张震', '山东省济南市槐荫区', '南美白对虾', '供方', '15589947672', '面议', '1512914229@qq.com', 'http://www.sdlcdb.com', '2019-03-15 11:51:00', '2019-12-30', '肝胰脏是南美白对虾最主要的消化腺，也是对虾最主要的免疫器官和排泄器官，集分泌消化酶、消化和吸收营养物质、贮存能量、解毒排毒等多重重要功能于一身。正因如此，肝胰脏是南美白对虾最重要的器官，同时，肝胰脏的正常与否也是对虾身体健康的一个非常重要的指标。当前，肝胰脏问题引发的疾病成为制约南美白对虾养殖成活率的重要因素，保肝护肝也已经成为对虾养殖中不可忽视的一个环节。正确有效地给南美白对虾保肝护肝需从以下几方面着手：一、预防为主，未病先治。南美白对虾正常的肝胰脏一般呈黄褐色，很多时候也受食物的颜色影响，健康的肝胰脏轮廓清晰、外观饱满。当肝胰脏发生病变时，初期会肿大发红，然后开始萎缩变白，到了后期就会糜烂坏死。在肝胰脏的发病初期，及时采取正确的措施，可以进行有效的预防和治疗。到了发病后期，肝胰脏发白萎缩、糜烂了，对虾往往会继发肠炎病、黄鳃病、黑鳃病、烂鳃病、红体病、白斑病等疾病，此时病情很难得到控制，往往引起大量死亡。因此，南美白对虾的保肝护肝要以预防为主、未病先治，是养殖全程都要贯穿的一个工作。二、密切关注水质变化，做好水质和底质的调节。氨氮和亚硝盐等化学指标偏高，对虾肝胰脏必然会受到损伤，还会引起对虾红体、脱壳期延长、脱壳不遂、软壳虾等情况。倒藻后，藻类的毒素集中释放出来，被对虾摄食，也会引起肝胰脏中毒。温差过高，或者水质突然变化，会导致对虾应激，损伤肝胰脏，引起对虾全身或某些部位发红，吃料减少。所以要定期进行水质、底质环境改良，经常培水，使虾塘一直处于良性的物质循环中，形成动态稳定的生态系统。三、定质定量定时地科学投喂饲料。劣质的饲料中霉菌毒素、重金属等毒害物质多，长期食用会对南美白对虾的肝胰脏造成不可逆的损伤，应当选择有信誉、质量有保证的南美白对虾专用饲料。养殖过程中不能急于求成，投料过多，过度摄食会加重对虾肝胰脏的负担，且对池塘的水质、底质形成污染，引起对虾的应激。四、拌料添加保肝护肝的胆汁酸。1、胆汁酸是动物内源性的，来源于胆汁，天然具有保肝护肝的作用。不需要经过肝胰脏的再次消化，胆汁酸可以直接发挥保肝护肝的作用，发挥作用快，见效快，且不会增加负担对肝胰脏造成二次损伤。2、肝胰脏是否健康，根本在于其能量贮存是否充足，也就是肝胰脏中的脂肪颗粒越多越健康。对虾不分泌胆汁酸，脂肪吸收能力很差，即使出现很小的应激，也会影响肝胰脏的消化吸收，随之带来肝胰脏疾病。胆汁酸能够提高对虾体内脂肪酶的活性，提高肝胰脏对饲料中的脂肪的消化利用率，增加能量贮存，从根本上保护好肝胰脏的健康。3、胆汁酸促进肝胰脏排毒。对虾吃进去的毒素，例如藻类毒素、重金属毒素等，都会损伤肝胰脏，严重的引起黑肝、肝萎缩等。胆汁酸一方面能够将毒素通过粪便排出，另一方增强肝胰脏的解毒能力，有效抵御毒素的侵害。', '7', '进行中');
INSERT INTO `contents` VALUES ('工厂化水产养殖漆 养殖水泥池刷漆 天可汗养殖漆', 'http://127.0.0.1:3000/public/images/2019021908124052.jpg', '天可汗生态池漆', '陈总经理', '专为蓄水池基材提供解决方案', '斑节对虾草虾', '供方', '13609557013', '870', 'tiankehan7@163.com', 'http://chinatkh.com', '2019-02-19 08:12:00', '2018-12-30', '天可汗生态养殖漆、鱼池漆——专为蓄水池基材提供解决方案天可汗生态养殖漆，鱼池漆锦鲤池专用环保漆专为养鱼池养虾池、海水养虾池，亲虾育苗池、鲍鱼苗池、虾苗池打造，获国家实用新型专利技术，更贴近自然环境，国内唯一一款水性健康养殖漆，有效提高水产养殖成活率，受到业界广大用户推崇。天可汗生态养殖漆、鱼池漆，是通过精选超细粒径的乳液、超细的颜填料、高耐水性环保助剂,科学配比制成环保型水池漆，产品环保水性无毒害。天可汗生态养殖漆源自德国创新1983，通过出色的综合性能获得了工厂化水产养殖权威专家的认可及赞赏。通过口碑相传，畅销至辽宁、黑龙江、宁夏、新疆、山东、天津、江苏、浙江、河北、广东、湖南、湖北、福建、海南、广西等地，帮助水产育苗、养殖的无忧管理。【陈总经理13609557013微信同号】养殖漆、鱼池漆锦鲤池专用环保漆功能养殖漆能保持养虾池池壁的光滑，有利于养鱼池虾池池壁的清洁，防止海水的腐蚀，避免鱼虾池细菌的滋生。特点：1、天可汗生态养殖漆、鱼池漆、虾池漆抗海水腐蚀强，独有抗氯离子配方，保护养鱼虾池池壁不会被海水腐蚀。2、天可汗生态养殖漆、鱼池漆、虾池漆附着力强，与基层结合力好。能渗透至水泥砂浆面基层和孔隙中，在基层表面形成连续的具有微弹性的坚韧保护膜。3、天可汗生态养殖漆、鱼池漆、虾池漆封闭性佳，抗碱性强。封闭基面水湿性底材碱性以防止水溶盐析出及随之而来的剥落。4、 天可汗生态养殖漆、鱼池漆、虾池漆耐污性好。表面粘着的污物、灰尘更容易清洁，有效维持保护膜洁净度。5、天可汗生态养殖漆、鱼池漆、虾池漆独有的保护膜仿生 “呼吸”功能。有效抵御海水渗入基材，同时调节基材与环境的湿度平衡。6、天可汗生态养殖漆、鱼池漆、虾池漆保护膜坚韧。保护鱼虾池池壁，防止水泥砂浆层碳化，延长使用寿命，节约维护成本。7、天可汗生态养殖漆、鱼池漆、虾池漆防霉、抗菌，提升养殖用水的水质。8、天可汗生态养殖漆、鱼池漆、虾池漆技术先进，原料选材标准高。连其中的填充料均选用药用级并通到FDA认证。9、天可汗生态养殖漆、鱼池漆、虾池漆质量稳定。已连续36年国家权威机构抽检100%合格。10、荣获中国著名品牌、中国科技产品奖、国家实用新型专利产品：201820563616.311、池漆专家：陈总经理13609557013微信同号', '8', '进行中');
INSERT INTO `contents` VALUES ('工厂化养殖对虾刷漆，养虾池漆', 'http://127.0.0.1:3000/public/images/2018120107501768.jpg', '南宝漆', '55年专注', '生态池漆', '斑节对虾草虾', '供方', '13305910017', '870', '', '', '2018-12-01 07:50:00', '2019-12-30', '工厂化养殖对虾刷漆，养虾池漆台湾南宝生态池漆应用于工厂化养殖对虾，专业的用途要求生态池漆必须满足工厂化养殖水体浸泡的需求，环保生态适用在鱼虾养殖池刷漆，目的是解决水泥混凝土碳化、老化，提升养殖水体洁净度，防止水泥表面的沾污物堆积，防止养殖池和水槽表面滋生细菌藻类等问题。台湾南宝生态池漆的基本特性1、水体和水泥池的双向防护养殖水体中存在着大量硫酸盐和氯化物，会使普通水泥受到腐蚀，这些成分不断的渗透到水泥内部，使水泥内部水化物产生体积膨胀而使混凝土构筑物表面开裂。生态池漆连续、不间断的微弹性漆膜有效阻隔水体与水泥池接触，既发挥防水、防渗水的作用，避免水泥池产生泛碱；更有效防止水泥池结构中的钢筋锈蚀导致的水泥池开裂，防止水泥池碳化，延长水泥池使用寿命，提高使用效果。2、漆膜兼具硬度与柔韧性符合水泥基层热胀冷缩的特性，不易在恶劣的环境应用中出现开裂，保护水泥基材，防止水泥砂浆层碳化，延长养殖水槽的使用寿命，节约维护成本。3、抗水流冲刷性生态池漆附着力强，与基层结合力好。能渗透至水泥砂浆面基层和孔隙中，在基层表面形成连续的具有微弹性的坚韧保护膜。独有的保护膜仿生 “呼吸”功能，能有效阻止养殖水体渗入基层，调节基材与环境的湿度平衡，保护基层免受侵蚀，延长养殖水槽的使用寿命，节约维护成本。同时，生态池漆漆膜帮助避免所养殖的鱼虾在养殖水槽内与基层摩擦时导致擦伤、感染，提升养殖效益。4、易清洁性通过包含分子结构设计、精准的分子量大小与分子量分布的控制，以及架桥技术的设计等，水产专用育苗养殖过程中产生的残饵和排泄物等池底沉积物不易在漆膜表面逗留并极易清洗，使生产管理中有益菌群、养殖水体PH值更好的调节。5、户外耐候性生态池漆在户外使用时，漆膜经受气候的考验，如受到阳光照射，温度变化，风吹雨淋、细菌等造成的综合破坏等外界条件的影响，其中紫外线照射是促使漆膜老化的关键因素。生态池漆不可逆的漆膜，为耐老化，耐候性提供基础保障。可以有效抵御户外风吹日晒雨淋的侵蚀，并具有抗紫外线特性，可以将紫外线的光能转换为热能，避免紫外线对养殖水槽的侵害。台湾南宝高技术发展的生态池漆的环保性经过专业的环保认证机构检测及认证，有：1、漆膜的环保性-“十环认证”（中国环境标志），证书编号：CEC 002 62841820-X；2、漆膜泡水后的析出物影响分析检测-饮用水相关国标GB/T 17219-1998卫生性能测试；3、低碳高效的认证-国际公认的检验、鉴定、测试和认证机构S G S碳足跡查证声明书合理保证等级验证，更荣获S G S《碳足跡查证声明书》。4、漆膜抗藻性的检测-采用生态技术，遵循国家标准GB/T 21353-2008，漆膜的抗藻性在全面的检测中，达到0级的标准。防止由此产生的青苔、细菌、藻类对养殖设备造成腐蚀和阻塞，有效提高循环水系统的工作效率及设备的使用寿命，完善了水体净化体系。出色的物理性表现和高质量的环保生态品质，台湾南宝生态池漆为绿色无公害的工厂化养殖对虾奠定可靠的基础保障！', '9', '进行中');
INSERT INTO `contents` VALUES ('养殖虾苗池漆，金鱼鲤鱼池漆，水上乐园及泳池漆等水槽漆', 'http://127.0.0.1:3000/public/images/2018092809430663.jpg', '凌祖明', '凌主管', '海峡漆总部', '斑节对虾草虾', '供方', '13003840419', '850', '965756034', '', '2018-09-28 09:43:00', '2022-12-30', '海峡漆-水性鱼池养殖漆，水槽漆凌主管，微信同号：13003840419(寻找空白区域代理商项目合作伙伴）适用于工厂化养殖的种类，如泥鳅苗、黄鳝苗、罗非鱼苗、鲫鱼苗、鲢鱼苗、鲤鱼苗、草鱼苗、青鱼苗、黄颡鱼苗、鳜鱼苗、鲈鱼苗、鳊鱼苗、鲶鱼苗、鳗鱼苗、多宝鱼苗、鲥鱼、鲟鱼苗、鳡鱼苗、生鱼苗、海参、鲍鱼、扇贝、多宝鱼、南美白对虾、河虾、罗氏沼虾、斑节对虾、基围虾等 　 海峡漆水性养殖池漆特点：1、抗淡水、海水腐蚀性强，独有抗氯离子配方，保护池壁不会被海水腐蚀。2、附着力强，与基层结合力好。能渗透至水泥砂浆面基层和孔隙中，在基层表面形成连续的具有微弹性的坚韧保护膜。3、封闭性佳，抗碱性强。封闭基面水湿性底材碱性以防止水溶盐析出及随之而来的剥落。4、耐污性好。表面粘着的污物、灰尘更容易清洁，有效维持保护膜洁净度。5、独有的保护膜仿生 “呼吸”功能。有效抵御海水渗入基材，同时调节基材与环境的湿度平衡。6、保护膜坚韧。保护水泥基材，防止水泥砂浆层碳化，延长使用寿命，节约维护成本。7、防霉、抗菌，提升养殖用水的水质。8、技术先进，原料选材标准高。连其中的填充料均选用药用级并通到FDA认证。9、质量稳定，屡获得过多项国家品牌荣誉。10、水性环保，生产、施工、使用过程对环境及人、动植物均无污染、无毒害。通过中国环境标志产品Ⅰ类认证、欧洲SGS食品级台湾绿建材认证、通过ISO14000环境管理体系认证。海峡育苗养殖池漆、水产漆通过实际应用效果，被黑龙江、辽宁、山东、河北、河南、山西、天津、上海、江苏、浙江、湖北、湖南、福建、海南、广东、广西、云南、新疆、宁夏等地育苗养殖公司（场）广泛采用，深得育苗养殖业科研机构专家及业者的信赖。海峡漆(养殖漆) 需任何产品咨询施工等等欢迎来电话，海峡漆工程部、凌祖明 13003840419祝您生意兴隆！感谢您的来电，我们将竭诚为您服务', '10', '进行中');
INSERT INTO `contents` VALUES ('求购草虾·希望规格30尾/公斤左右', 'http://127.0.0.1:3000/public/images/no_pic.gif', '温州鱼之乐贸易有限公司', '项先生', '温州市锦绣路锦城商务楼301室-A', '斑节对虾草虾', '求方', '18958963111', '', 'yuzhileco@163.com', '', '2014-05-11 10:14:00', '2018-12-30', '希望规格：30尾/公斤左右具体电聊或发邮件。18958963111yuzhileco@163.com', '11', '进行中');
INSERT INTO `contents` VALUES ('供应冷冻罗氏沼虾', 'http://127.0.0.1:3000/public/images/no_pic.gif', '水产品供应江苏', '宋先生', '江苏省连云港市赣榆区', '罗氏沼虾', '供方', '13151387266', '', '', '', '2019-02-22 09:42:00', '2018-12-30', '大批量供应活冻罗氏沼虾，大中等规格，价格实惠，欢迎垂询选购，联系电话（微信）：13151387266', '12', '进行中');
INSERT INTO `contents` VALUES ('求购罗氏沼虾广东惠州钓虾场', 'http://127.0.0.1:3000/public/images/no_pic.gif', '小火鸡', '张生', '广东省惠州市博罗县罗阳镇中园五路', '罗氏沼虾', '求方', '13828477203', '', '441800511@qq.com', '', '2016-07-07 19:31:00', '2018-12-30', '广东惠州钓虾场找长期供应罗氏虾钓场使用', '13', '进行中');
INSERT INTO `contents` VALUES ('罗氏沼虾苗供应', 'http://127.0.0.1:3000/public/images/no_pic.gif', '刘纵横', '刘先生', '湖州市东林镇青山', '罗氏沼虾', '供方', '13305725165', '随行就市', '', '', '2019-01-12 04:21:00', '2020-12-12', '本虾苗场专业培育罗氏沼虾苗种，和水产研究部门合作，挑选优质种虾，经过强化培育，自2019年1月15日开始向全国各地供应优质罗氏沼虾淡化苗，欢迎大家订购。联系电话13305725165刘先生', '14', '进行中');
INSERT INTO `contents` VALUES ('河虾青虾苗', 'http://127.0.0.1:3000/public/images/2019030622183634.jpg', '菱湖水产合作', '沈根财', '浙江省湖州市南浔区菱湖镇', '河虾青虾', '供方', '13732386989', '电联或微信', '', '', '2019-03-06 22:18:00', '2018-12-30', '皮毛和成活率我是可以保证的本人常年供应钓鱼场 水箱车送货上门  合作联系 电话/微信13732396989目前主要有：银鳕鱼  1-3斤鲈鱼    6两-1斤半大青鱼  5-8斤 8-15斤 20+ 30+少量不定期有货鳊鱼    1-2斤鲫鱼    5两-1斤翘嘴大白条（翘嘴红鲌） 1-3斤 等各类商品鱼   苗种：小白条苗   30尾/斤小黑鱼苗   3-5尾/斤小青鱼苗   8-12尾/斤小草鱼苗   5-10尾/斤小鲫鱼苗   5-10尾/斤河虾青虾苗小花鲢苗，小白鲢苗，小鳊鱼苗黄颡苗/黑鱼苗/银鳕鱼苗/花骨鱼/鲈鱼苗/桂鱼(鳜鱼)苗/太阳鱼等各类苗种', '15', '进行中');
INSERT INTO `contents` VALUES ('全国大量求购河虾、山根麦穗杂鱼寻长期合作伙伴', 'http://127.0.0.1:3000/public/images/2018040911100488.jpg', '白洋淀水产供销公司', '于先生', '河北省保定市雄安新区', '河虾青虾', '求方', '13400354672', '电议', '微信：13400354672', '', '2018-04-09 11:10:00', '2018-12-30', '我司自1990年成立以来，秉着诚信经营，相互受益的经营理念，赢得了广大合作伙伴的一致认可。我司主要经营各种淡水鱼虾的收售及相应的捕捞工作。现大量求购河虾、杂鱼。大小不限，养殖野生均。活鱼虾的优先。有货的朋友请及时联系！最好是河北周边的朋友，同时寻求优质水库承包。', '16', '进行中');
INSERT INTO `contents` VALUES ('出售优质青虾苗（蟹塘增加收入好帮手）,,太湖2号苗', 'http://127.0.0.1:3000/public/images/2018111220455979.jpg', '嘉俊', '赵家俊', '南京高淳桠溪', '河虾青虾', '供方', '15151900998', '', '', '', '2018-11-12 20:46:00', '2019-12-30', '鲜活青虾苗出售15151900998     赵先生   以质量求生存欢迎大家前来洽谈。', '17', '进行中');
INSERT INTO `contents` VALUES ('大量收购青虾', 'http://127.0.0.1:3000/public/images/no_pic.gif', '加速小鱼鱼儿', '郭', '湖北省丹江口市樊丹路博澳水产品有限公司', '河虾青虾', '求方', '15171409795', '', '', '', '2017-06-15 10:27:00', '2018-12-30', '公司2006年成立于湖北省丹江口市，位于道教名山武当山下，亚洲第一人工湖丹江口水库之滨，占地50余亩。公司品牌“好鱼轩”主要产品包括各类淡水鱼冰鲜、冰冻、熟制、传统风干等深加工。我们公司目前大量收购2-4公分的青虾，非诚勿扰！！！！', '18', '进行中');
INSERT INTO `contents` VALUES ('紧急求购中国对虾苗(东方对虾苗），有的老板速速联系！！诚信第一', 'http://127.0.0.1:3000/public/images/no_pic.gif', 'yanzhihao521', '闫', '山东省烟台市', '东方对虾中国对虾', '求方', '13583546768', '', '81200382@qq.com', '', '2017-03-18 21:00:00', '2018-12-30', '紧急求购中国对虾苗(东方对虾苗），有的老板速速联系！！诚信第一', '19', '进行中');
INSERT INTO `contents` VALUES ('需要虾药，请虾药的供应商、业务员联系我一下', 'http://127.0.0.1:3000/public/images/no_pic.gif', '符氏', '符家聪', '海南省东方市', '东方对虾中国对虾', '求方', '13637589072', '', '809862296@qq.com', '', '2017-02-23 10:15:00', '2018-12-30', '我准备在海南东方开个经营虾药的店面，请各位虾药的供应商、代理商、业务员能主动联系一下！', '20', '进行中');
INSERT INTO `contents` VALUES ('供应生产船冻竹节虾', 'http://127.0.0.1:3000/public/images/no_pic.gif', '董知杰', '董先生', '浙江省台州市椒江区', '竹节虾日本对虾', '供方', '15824098823', '', '', '', '2016-12-03 19:12:00', '2018-12-30', '微信：d526024468', '21', '进行中');
INSERT INTO `contents` VALUES ('为什么加拿大龙虾食补会成为一种新潮流，这种趋势又会持续多久', 'http://127.0.0.1:3000/public/images/2016082509043379.jpg', '大渔场', '王女士', '大连市沙河口区民政街417号', '波士顿龙虾', '供方', '15840950722', '', '1635280196@qq.com', '', '2016-08-25 09:04:00', '2018-12-30', '满足人们对美食的追求  随着人们生活水平的提高，人们从温饱型向小康型转变，已经不满足于吃饱，而且要求吃好，要求在感官上获得美感（味、触、香、色、形），即对美食的需求越来越强烈。大渔场加拿大龙虾均能满足人们对美食的苛刻要求。在中国，龙虾是地位的象征，龙虾的红色被认为是幸运的颜色。大渔场加拿大龙虾有两个硕大、肉质丰厚的前螯，其重量约占龙虾体重的15%。第一步足为一对大螯，一侧的螯稍大于另一侧。体表光滑，触角较细。由于它们的生长环境是冰冷纯净的原生态水域，以这里的藻类和小鱼小虾为食，肉质紧实，嫩滑细致,味道鲜美。满足人们对食品安全的要求近年来，国内食品安全形势越来越严峻，国人越来越追求健康无污染的生活，出产自纯净海域的大渔场加拿大龙虾自然就成为国人热衷的食物，龙虾只出产于北美寒冷海域，世界其他地方并不可见，而且靠近北极圈冰冷海域，常年海水极冷，没有受到污染。龙虾经常以鱼类、其他小型甲壳类及贝类为食，偶尔也会吃海中植物。这两点保证了食用龙虾的安全性。满足人们对营养价值的渴求龙虾性温，平缓，极适宜夏季进食，有补肾壮阳、健胃补气、祛痰抗癌等功效。主治食管癌、肠癌、肾虚阳痿、遗精、脾胃虚弱、痰火后半身不遂、筋骨疼痛、神经衰弱。并且具有高蛋白，低脂肪，维生素A、C、D及钙、钠、钾、镁、磷、铁、硫、铜等微量元素丰富，无论是老人、小孩还是上班族食用都具有良好的温补功效。满足人们对快速消费的需求如今移动互联网发展迅速，带动了一大批新兴产业，这其中电商就以星火燎原之势拔地而起。传统的采购虽然仍是主流，但是网上订单不可小觑。大渔场的网络销售平台上专门提供来自加拿大的鲜活大龙虾，给顾客最迅速和最美味的体验。作为中国高端龙虾第一人的大渔场郑云一直秉承这样一种信念，消费是一种享受，产品是一种生活品味。与其降低产品质量或服务质量来降低价格，不如专注于提升成品的客户体验度。大多数人认识郑云涛是从中央七套播出的《致富经》栏目，这位当年凭借50元钱闯大连的拼搏小伙给观众留下了深刻印象，与节目不同的是，郑云涛不仅是一位稳扎稳打的创业者，更是一位对商业有着精准嗅觉和判断力的成功商人。', '22', '进行中');
INSERT INTO `contents` VALUES ('车虾日本对虾', 'http://127.0.0.1:3000/public/images/no_pic.gif', '红扬水产', '王女士', '山东烟台海阳', '竹节虾日本对虾', '供方', '18766692132', '', '1357831473qq@.com', '', '2016-11-05 06:48:00', '2017-12-30', '本人常年供应养殖车虾日本对虾', '23', '进行中');
INSERT INTO `contents` VALUES ('求购酒宴用的大龙虾。', 'http://127.0.0.1:3000/public/images/no_pic.gif', '陈先生莆田', '陈先生', '福建莆田', '波士顿龙虾', '求方', '13615930867', '', '', '', '2015-05-08 15:49:00', '2018-12-30', '求购酒宴用的大龙虾。能长期合作最佳。', '24', '进行中');
INSERT INTO `contents` VALUES ('宝鸡鲜活生蚝批发-生蚝多少钱一斤', 'http://127.0.0.1:3000/public/images/2018101113013338.jpg', 'a', 'a', '宝鸡生蚝批发市场-产地直销-全国发货', '生蚝', '供方', '13138201006', '99', '13138201006@163.com', '', '2018-10-11 13:01:00', '2025-12-30', '宝鸡，生蚝批发，生蚝多少钱一斤，生蚝批发市场价格，扇贝批发，花蛤批发，多春鱼批发，更多海产冻品加微信：omersea。冷链物流全国发货。欢迎各地批发商，烧烤档，餐饮酒楼，海鲜档，个人团体，来人来电洽谈。生蚝批发价格说明小蚝规格，1件400个 中蚝规格，1件240个大蚝规格，1件170个特大蚝规格，1件120个小扇贝规格，5-7cm中扇贝规格，8-10cm大扇贝规格，10-12cm扇贝王规格，15-17cm冷冻海产货源充足，一手货源，鲜活生蚝产地直发，质量保证，冷链物流。', '26', '进行中');
INSERT INTO `contents` VALUES ('贵州鲜活生蚝批发-海鲜生蚝批发市场', 'http://127.0.0.1:3000/public/images/2018101112573737.jpg', 'a', 'a', '贵州生蚝批发市场-产地直销-全国发货', '生蚝', '供方', '13138201006', '99', '13138201006@163.com', '', '2018-10-11 12:57:00', '2025-12-30', '贵州，生蚝批发，生蚝多少钱一斤，生蚝批发市场价格，扇贝批发，花蛤批发，多春鱼批发，更多海产冻品加微信：omersea。冷链物流全国发货。欢迎各地批发商，烧烤档，餐饮酒楼，海鲜档，个人团体，来人来电洽谈。生蚝批发价格说明小蚝规格，1件400个 中蚝规格，1件240个大蚝规格，1件170个特大蚝规格，1件120个小扇贝规格，5-7cm中扇贝规格，8-10cm大扇贝规格，10-12cm扇贝王规格，15-17cm冷冻海产货源充足，一手货源，鲜活生蚝产地直发，质量保证，冷链物流。', '27', '已结束');
INSERT INTO `contents` VALUES ('大量求购海蛎子', 'http://127.0.0.1:3000/public/images/2016032908452455.jpg', '我想我可以更好', '刘经理', '山东省济南市济阳县', '生蚝', '求方', '13969100927', '面议', '1174862201@qq.com', '', '2016-03-29 08:46:00', '2018-12-30', '大量收购海蛎子 10公分左右   味道鲜美 有意者请联系  联系人：刘经理  联系电话：13969100927', '30', '进行中');

-- ----------------------------
-- Table structure for `news`
-- ----------------------------
DROP TABLE IF EXISTS `news`;
CREATE TABLE `news` (
  `title` varchar(255) NOT NULL,
  `contents` text NOT NULL,
  `time` datetime NOT NULL,
  `category` char(255) NOT NULL,
  PRIMARY KEY (`title`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of news
-- ----------------------------
INSERT INTO `news` VALUES ('大棚三茬虾养殖模式，拉长销售期，避开高峰期，卖出高价虾', '大棚三茬虾养殖优势\r\n\r\n1.优势\r\n嘉善县干窑镇江升家庭农场利用大棚设施开展虾类三茬养殖，通过两茬罗氏沼虾套养一茬南美白对虾发展高产模式，沼虾上市时间较往年提早了近20天，首批罗氏沼虾卖出94元/千克的高价，是沼虾集中上市时价格的一倍有余。下半年，利用钢丝大棚控温延长罗氏沼虾的销售期，11月份出售的罗氏沼虾价格也较集中上市期高40%左右。\r\n\r\n2.发病风险较小\r\n南美白对虾、罗氏沼虾混养技术，与单一的南美白对虾、罗氏沼虾主养模式相比，发病风险较小；模式利用多种生物之间一定的互补性，较好地营造了池塘生态的养殖环境，利用罗氏沼虾的杂食性特点摄食南美白对虾的残饵并吃掉塘内的病死虾体，可有效地控制南美白对虾病原传染，继而保障对虾的产量。\r\n\r\n四、大棚三茬虾养殖注意事项\r\n\r\n1.苗种放养\r\n苗种是虾类养殖成败的关键，购买规格合适的优质虾苗，应去大型、信誉较好的生产厂家。苗种放养需注意天气、水温，做好水质调控，并根据池塘情况合理放养。\r\n\r\n2.水质调节\r\n养殖过程中，利用微生物制剂调控水质，罗氏沼虾养殖过程中注意补充钙质，可加快蜕壳后虾壳的硬化，确保罗氏沼虾健康生长。\r\n\r\n3.尼龙膜需每年更换\r\n覆盖在钢丝大棚外层的尼龙膜需每年更换，重复使用尼龙膜的光照渗透率低，容易导致大棚内阳光不足，虾类上市时间可能延迟20天左右。', '2019-05-09 18:23:23', 'new');
INSERT INTO `news` VALUES ('最新消息！！', '用户可以认证啦！！', '2019-04-09 17:09:03', 'new');
INSERT INTO `news` VALUES ('注意！！', '注册用户请注意！须文明发言！', '2019-04-27 20:17:14', 'notice');
INSERT INTO `news` VALUES ('广东珠海地区罗虾种草养殖日常管理及常见问题处理', '养殖关键技术：1、种草;放苗前池塘注水30-40cm，采集伊乐藻草种沿塘边种植2-3圈。采集的草种要求新鲜嫩绿，叶片完整度好，无螺，无虫，定期5-7天使用可溶性有机肥“藻安生”5亩/瓶+“活力碳”5亩/瓶，促进伊乐藻的生长，但要注意施肥不宜过重，当伊乐藻种植成功后再放虾苗。伊乐藻既能调节水质，也可增加水中的浮游动物，给罗虾提供天然饵料。2、防控气泡病：随着伊乐藻大量生长，光合作用增强，水体的酸碱度上升，罗氏沼虾易发生气泡病，天气晴朗的时候适量缓慢加水，直至水深达到1.5-1.8米，同时白天少开或者不开增氧机，降低水草的光合作用，防止虾苗发生气泡病。高温季节，水草也可以供罗虾平时躲避和纳凉。3、保草：若水草管理不好，将严重影响罗虾的生长。整个养殖过程需要控制水草的生长密度，生长茂盛时，要人工拔除，降低水草的总量，保持水草旺盛的生长力；每隔7-10天补充“藻安生”5亩/瓶+“活力碳”5亩/瓶补碳补肥，尤其是天气变化时，更要提前补肥；养殖过程中少用或不用消毒杀虫药，以免造成伊乐藻大量死亡，破坏生态系统，导致罗虾严重缺氧；定期5-7天使用“福地安+底虫净”改底防虫。4、分批抓虾、降低密度：后期抓虾捕大留小分批上市，第一次抓走大部分虾，剩余小虾养殖一段时间后再出塘卖虾，降低养殖密度，减少养殖风险，提高养殖效益。常见问题及处理措施1、伊乐藻生虫烂叶子：伊乐藻生虫烂叶会导致水草老化死亡，容易污染水质。今年水草增多，其原因大概有以下两点：一是采集草种时带入；二是进水时带入或底质环境恶化滋生虫子。解决方案：采集草种时要严格按照要求挑选，有条件的尽量过滤水源，其次加大“福地安+底虫净”的改底频率。2、罗虾纤毛虫滋生：罗虾吃料时间相对长，投喂量若控制不好，容易造成池底污染严重，滋生纤毛虫。纤毛虫主要附着在罗虾的体表、附肢、眼和鳃上，使虾烦躁不安，在池边频繁游动，妨碍摄食、蜕壳，影响生长。解决方案：平时合理投喂，控制吃料时间，坚持用“利多精+LY-生命素+营养快线”拌料投喂，增强罗虾体质。3、罗虾“偷死”：中后期水草多极易造成晚上水体缺氧，死亡腐烂的水草若不及时清除会导致亚硝酸盐、氨氮等有毒物质增加，这些都会造成罗虾死亡。解决方案；控制水草数量，增加增氧机配置，叶轮增氧机增氧效率低，可以采用底管充气增氧，夜间用“氧速保”辅助增氧，及时清除老化死亡水草，巧用“碧水安”、“速解安”解毒调水，勤用“底居安”、“底加氧”改底，预防罗虾偷死，提高养殖产量。', '2019-05-10 04:33:53', 'new');

-- ----------------------------
-- Table structure for `pcheck`
-- ----------------------------
DROP TABLE IF EXISTS `pcheck`;
CREATE TABLE `pcheck` (
  `account` varchar(255) NOT NULL,
  `type` varchar(255) NOT NULL,
  `checkimg` varchar(255) NOT NULL,
  `id` int(11) NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of pcheck
-- ----------------------------

-- ----------------------------
-- Table structure for `publish`
-- ----------------------------
DROP TABLE IF EXISTS `publish`;
CREATE TABLE `publish` (
  `title` varchar(255) NOT NULL,
  `author` varchar(255) NOT NULL,
  `pid` int(11) NOT NULL,
  `time` datetime DEFAULT NULL,
  `id` int(11) NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`id`),
  KEY `author` (`author`)
) ENGINE=MyISAM AUTO_INCREMENT=15 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of publish
-- ----------------------------
INSERT INTO `publish` VALUES ('波士顿龙虾，来自大西洋的海鲜盛宴', 'a', '25', '2019-04-26 13:07:23', '1');
INSERT INTO `publish` VALUES ('宝鸡鲜活生蚝批发-生蚝多少钱一斤', 'a', '26', '2019-04-27 15:08:02', '2');
INSERT INTO `publish` VALUES ('贵州鲜活生蚝批发-海鲜生蚝批发市场', 'a', '27', '2019-04-28 13:25:47', '3');

-- ----------------------------
-- Table structure for `user`
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `account` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `nick` varchar(255) NOT NULL,
  `phone` char(11) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `location` varchar(255) DEFAULT NULL,
  `pchecked` char(5) DEFAULT 'n',
  `cchecked` char(5) DEFAULT 'n',
  `headimage` varchar(255) DEFAULT 'http://127.0.0.1:3000/public/images/timg.jpg',
  `question` varchar(255) NOT NULL,
  `answer` varchar(255) NOT NULL,
  PRIMARY KEY (`account`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES ('a', 'a', '三只虎', '12312312312', '1234412412@qq.com', '广东省广州市', 'n', 'n', 'http://127.0.0.1:3000/public/images/me_2019_4_4_2_59.jpg', '家乡在哪？', '广东');
INSERT INTO `user` VALUES ('gd', 'a', 'gd', '1', '1', '1', 'n', 'n', 'http://127.0.0.1:3000/public/images/f39d6fe25702c03805f83ab0b7e51dcf_2019_4_4_23_15.jpg', '宿舍有几人', '6');
